---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetRebarContainersInHost
source: html/56ac8351-cf96-d1cb-cd44-551917ab3540.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetRebarContainersInHost Method

Returns all RebarContainer elements hosted by the referenced element.

## Syntax (C#)
```csharp
public IList<RebarContainer> GetRebarContainersInHost()
```